# Завдання 1. Оптимізація виробництва
# Компанія виробляє два види напоїв: "Лимонад" і "Фруктовий сік". 
# Для виробництва цих напоїв використовуються різні інгредієнти та обмежена кількість обладнання. 
# Задача полягає у максимізації виробництва, враховуючи обмежені ресурси.

# Умови завдання:
# "Лимонад" виготовляється з "Води", "Цукру" та "Лимонного соку".
# "Фруктовий сік" виготовляється з "Фруктового пюре" та "Води".
# Обмеження ресурсів: 100 од. "Води", 50 од. "Цукру", 30 од. "Лимонного соку" та 40 од. "Фруктового пюре".
# Виробництво одиниці "Лимонаду" вимагає 2 од. "Води", 1 од. "Цукру" та 1 од. "Лимонного соку".
# Виробництво одиниці "Фруктового соку" вимагає 2 од. "Фруктового пюре" та 1 од. "Води".
# Використовуючи PuLP, створіть модель, яка визначає, скільки "Лимонаду" та "Фруктового соку" 
# потрібно виробити для максимізації загальної кількості продуктів, дотримуючись обмежень на ресурси. 
# Напишіть програму, код якої максимізує загальну кількість вироблених продуктів "Лимонад" та "Фруктовий сік", 
# враховуючи обмеження на кількість ресурсів.

import pulp

# Створення проблеми
problem = pulp.LpProblem("Maximize_Production", pulp.LpMaximize)

# Визначення змінних
lemonade = pulp.LpVariable("Lemonade", lowBound=0, cat='Continuous')
fruit_juice = pulp.LpVariable("Fruit_Juice", lowBound=0, cat='Continuous')

# Функція цільової функції
problem += lemonade + fruit_juice, "Total_Products"

# Обмеження
# Вода: 2 од. на Лимонад, 1 од. на Фруктовий сік, всього 100 од.
problem += 2 * lemonade + 1 * fruit_juice <= 100, "Water"

# Цукор: 1 од. на Лимонад, всього 50 од.
problem += 1 * lemonade <= 50, "Sugar"

# Лимонний сік: 1 од. на Лимонад, всього 30 од.
problem += 1 * lemonade <= 30, "Lemon_Juice"

# Фруктове пюре: 2 од. на Фруктовий сік, всього 40 од.
problem += 2 * fruit_juice <= 40, "Fruit_Puree"

# Розв'язання проблеми
problem.solve()

# Виведення результатів
print(f"Status: {pulp.LpStatus[problem.status]}")
print(f"Lemonade to produce: {lemonade.varValue}")
print(f"Fruit Juice to produce: {fruit_juice.varValue}")
print(f"Total products produced: {lemonade.varValue + fruit_juice.varValue}")
